# CLI tools
brew "age"
brew "bat"
brew "curl"
brew "defaultbrowser"
brew "espeak-ng"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "micro"
brew "midnight-commander"
brew "nmap"
brew "postgresql"
brew "rclone"
brew "ripgrep"
brew "ruby"
brew "tailscale"
brew "tesseract"
brew "tmux"
brew "tree"
brew "wget"
brew "wireshark"
brew "yt-dlp"

# Applications (via Homebrew Cask)
cask "claude-code"
cask "cursor"
cask "font-iosevka"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keet"
# cask "visual-studio-code"
# cask "rectangle"
# cask "1password"
# cask "slack"
# cask "firefox"
# cask "docker"

# Mac App Store (requires `mas` CLI)
# mas "Xcode", id: 497799835
